app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "123"], ["created_at", Tue, 12 Aug 2014 12:40:54 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 12 Aug 2014 12:40:54 UTC +00:00]]
---
      <em>
		 <strong>Posted <%= time_ago_in_words(comment.created_at) %> ago by <%= User.find(comment.user_id).email%></strong>