app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Tue, 12 Aug 2014 09:27:24 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 12 Aug 2014 09:27:24 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id ])
    @comment = @post.comments.create!(comment_params)