app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "cxxxxxx"], ["created_at", Mon, 11 Aug 2014 13:33:44 UTC +00:00], ["title", "asdasd"], ["updated_at", Mon, 11 Aug 2014 13:33:44 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["body", "I am New Post!"], ["updated_at", "2014-08-13 07:40:56.489139"]]